chavid/devcpp20:v14.2> ./compile-g++.sh 23 3 saxpy
chavid/devcpp20:v14.2> ./run.sh saxpy aos vector half 65536 3125
0.34 s,  3848 kBytes, -0.22692871
chavid/devcpp20:v14.2> ./run.sh saxpy aos vector float 65536 3125
0.08 s,  3840 kBytes, -0.2789213
chavid/devcpp20:v14.2> ./run.sh saxpy aos vector double 65536 3125
0.09 s,  4086 kBytes, -0.2789198972385825
chavid/devcpp20:v14.2> ./run.sh saxpy aos vector long 65536 3125
0.30 s,  5170 kBytes, -0.27891989723860535134
chavid/devcpp20:v14.2> ./run.sh saxpy aos vector quad 65536 3125
5.35 s,  5162 kBytes, -0.27891989723860534538645834726796224
chavid/devcpp20:v14.2> ./run.sh saxpy soa vector half 65536 3125
0.54 s,  3754 kBytes, -0.22692871
chavid/devcpp20:v14.2> ./run.sh saxpy soa vector float 65536 3125
0.03 s,  3798 kBytes, -0.2789213
chavid/devcpp20:v14.2> ./run.sh saxpy soa vector double 65536 3125
0.06 s,  4054 kBytes, -0.2789198972385825
chavid/devcpp20:v14.2> ./run.sh saxpy soa vector long 65536 3125
0.30 s,  5116 kBytes, -0.27891989723860535134
chavid/devcpp20:v14.2> ./run.sh saxpy soa vector quad 65536 3125
5.35 s,  5108 kBytes, -0.27891989723860534538645834726796224
